In [1]:
import pandas as pd
import numpy as np

In [2]:
email = 'mdtanvirt@gmail.com'

In [3]:
email

'mdtanvirt@gmail.com'

In [4]:
email.split('@')

['mdtanvirt', 'gmail.com']

In [5]:
name = pd.Series(['Tanvir', 'Tania', 'Junaira', 'Junaisa', '5'])

In [6]:
name

0     Tanvir
1      Tania
2    Junaira
3    Junaisa
4          5
dtype: object

In [7]:
name.str.upper()

0     TANVIR
1      TANIA
2    JUNAIRA
3    JUNAISA
4          5
dtype: object

In [8]:
name.str.lower()

0     tanvir
1      tania
2    junaira
3    junaisa
4          5
dtype: object

In [9]:
email.isdigit()

False

In [10]:
'5'.isdigit()

True

In [11]:
name.str.isdigit()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [13]:
tech_company = ['Google, hibride, general', 'Amazon, alibaba', 'Apple, Oppo']
len(tech_company)

3

In [16]:
tech_company_series_data = pd.Series(tech_company)
tech_company_series_data

0    Google, hibride, general
1             Amazon, alibaba
2                 Apple, Oppo
dtype: object

In [17]:
tech_company_series_data.str.split(',')

0    [Google,  hibride,  general]
1              [Amazon,  alibaba]
2                  [Apple,  Oppo]
dtype: object

In [18]:
tech_company_series_data.str.split(',', expand=True)

        0         1         2
0  Google   hibride   general
1  Amazon   alibaba      None
2   Apple      Oppo      None

In [23]:
messey_name = pd.Series(['karim  ', 'Rah,im', '  "Job;bar', '  Soki  na'])
messey_name

0       karim
1        Rah,im
2      "Job;bar
3      Soki  na
dtype: object

In [28]:
messey_name.str.replace(',', '').str.replace(';', '').str.strip().str.capitalize()

0       Karim
1       Rahim
2     "jobbar
3    Soki  na
dtype: object

## The professional way to manage the above "messy_name" issues

In [30]:
def cleanup(name):
    name = name.replace(';', '')
    name = name.replace(',', '')
    name = name.strip()
    name = name.capitalize()
    return name

In [31]:
messey_name.apply(cleanup)

0       Karim
1       Rahim
2     "jobbar
3    Soki  na
dtype: object

In [33]:
## Alternative way using Vectorize method
np.vectorize(cleanup)(messey_name)

array(['Karim', 'Rahim', '"jobbar', 'Soki  na'], dtype='<U8')